Catalogs/ВидыПлановКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыПлановКомпании</Name>
			<Comment>Виды планов при планировании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ВидыПлановКомпании</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Comment>Периодичность заполнения и сверки плановых и фактических документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаПланирования</Name>
					<Comment>Используется для фильтрации состава аналитических объектов в обработках заполнения</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Тип первого аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Тип второго аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Наименование первого числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Наименование второго числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Наименование третьего числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Список параметров плановых документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Параметр планового документа</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Comment>Тип значения параметра планового документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазовыеПланы</Name>
					<Comment>Список видов планов, от которых зависит заполнение планов данного вида</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана, от которого зависит данный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗависимости</Name>
							<Comment>По своему подразделению, по вложенным подразделениям, по родительскому подразделению</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗависимостейПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборОбъектаПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Табличная часть, содержащая список подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Подразделение компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлана</Name>
							<Comment>Количество дней отсрочки плана от начала периода планирования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаФакта</Name>
							<Comment>Количество дней отсрочки факта от конца периода планирования для расчета факта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыИОбработки</Name>
					<Comment>Перечень отчетов и обработок, связанных с данным объектом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование отчета / обработки для интерактивного выбора</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияПлана</Name>
							<Comment>Признак наличия процедуры заполнения планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагПроверкиПлана</Name>
							<Comment>Признак наличия процедуры проверки планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияФакта</Name>
							<Comment>Признак наличия процедуры заполнения фактического документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборВидаОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыПлановКомпании/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отказ = Отказ Или РаботаСФормой.НужноОтменитьОткрытиеФормы();
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	РаботаСФормой.ЗаблокироватьРедактированиеПредопределенногоЭлемента(ЭтотОбъект);
	РаботаСФормой.УстановитьДоступностьПоляКодНаФормеСправочника(ЭтотОбъект, Объект);
	
	Справочники.ВидыПлановКомпании.ОбработкаПересчетаТабличнойЧастиОтчетыИОбработки(Объект,Неопределено);
	Справочники.ВидыПлановКомпании.ОбработкаПересчетаТабличнойЧастиБазовыеПланы(Объект,Неопределено);
	
	ВыбраннаяОбработка = Обработки;
	Для Каждого СтрокаОбработки Из Метаданные.Обработки Цикл
		Если СтрНайти(СтрокаОбработки.Имя,"План")<>0 Тогда
			СписокОбработок.Добавить(СтрокаОбработки.Имя, СтрокаОбработки.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УправлениеДиалогомНаСервере();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ПараметрыПлана");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "БазовыеПланы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Подразделения");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ОтчетыИОбработки");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РаботаСФормойКлиент.ЗамерВремениЗапись("СкладыКомпании");
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

	УправлениеДиалогомНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры 


#КонецОбласти
       
#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПлана

#Область ОбработчикиСобытийПолейТаблицыФормыПараметрыПланирования

&НаСервере
Процедура ПараметрыПланаВидПараметраПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ПараметрыПлана.НайтиПоИдентификатору(Элементы.ПараметрыПлана.ТекущаяСтрока);
	
	Если Элементы.ПараметрыПланаТипЗначения.Видимость Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ВидПараметра) Тогда
			ТекущиеДанные.ТипЗначения = ТекущиеДанные.ВидПараметра.ТипЗначения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПараметрыПланаВидПараметраПриИзмененииНаСервере()

&НаКлиенте
Процедура ПараметрыПланаВидПараметраПриИзменении(Элемент)
	
	ПараметрыПланаВидПараметраПриИзмененииНаСервере();
	
КонецПроцедуры // ПараметрыПланаВидПараметраПриИзменении()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБазовыеПланы

#Область ОбработчикиСобытийЭлементовТаблицыБазовыеПланы

&НаСервере
Процедура БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.БазовыеПланы.НайтиПоИдентификатору(Элементы.БазовыеПланы.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ВидыПлановКомпании.БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // БазовыеПланыПланированияПоАналитикеПриИзмененииНаСервере()

&НаКлиенте
Процедура БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзмененииНаСервере();
	
КонецПроцедуры // БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтчетыИОбработки

#Область ОбработчикиСобытийПолейТаблицыОтчетыИОбработки

&НаСервере
Процедура ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	Справочники.ВидыПлановКомпании.ОтчетыИОбработкиВыборВидаОбъектаПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтчетыИОбработкиВыборВидаОбъектаПриИзменении(Элемент)
	
	ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ОтчетыИОбработкиФлагЗаполненияФактаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагЗаполненияФакта = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтчетыИОбработкиФлагЗаполненияФактаПриИзменении(Элемент)
	
	ОтчетыИОбработкиФлагЗаполненияФактаПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ОтчетыИОбработкиФлагПроверкиПланаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);

	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагПроверкиПлана = Ложь;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОтчетыИОбработкиФлагПроверкиПланаПриИзменении(Элемент)
	
	ОтчетыИОбработкиФлагПроверкиПланаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтчетыИОбработкиФлагЗаполненияПланаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	
	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагЗаполненияПлана = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтчетыИОбработкиФлагЗаполненияПланаПриИзменении(Элемент)
	
	ОтчетыИОбработкиФлагЗаполненияПланаПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтчетыИОбработкиПутьКОбъектуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Формируем описание обработчика перехвата закрытия формы
	ОбработчикРезультата = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияПутьКОбъекту", ЭтотОбъект);
	
	Если (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=2)
		ИЛИ (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=4) Тогда
		
		СписокДляВыбора = Новый СписокЗначений();
		СписокДляВыбора.Добавить("ВЫБРАТЬ ИЗ диалога");
		ПоказатьВыборИзМеню(ОбработчикРезультата,СписокДляВыбора, Элемент);
		
	ИначеЕсли (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=3) Тогда
		
		ПоказатьВыборИзМеню(ОбработчикРезультата,СписокОбработок, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры 
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПутьКОбъекту(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКОбъекту = РезультатОповещения.Значение;
	Наименование = РезультатОповещения.Представление;
	
	Если ПутьКОбъекту="ВЫБРАТЬ ИЗ диалога" Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Каталог = КаталогДокументов();
		Если Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=2 Тогда
			Фильтр = "Текстовый файл(*.txt)|*.txt";
		Иначе
			Фильтр = "Внешняя обработка(*.epf)|*.epf";
		КонецЕсли;
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДиалогОткрытияФайла", ДиалогОткрытияФайла);
		ДополнительныеПараметры.Вставить("Наименование",        Наименование);
		ДополнительныеПараметры.Вставить("РезультатОповещения", РезультатОповещения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияПутьКОбъектуЗавершение",
														ЭтотОбъект, ДополнительныеПараметры);
		ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
		Возврат;
	КонецЕсли;
	
	ОбработкаРезультатаОповещенияПутьКОбъектуФрагмент(Наименование, ПутьКОбъекту, РезультатОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПутьКОбъектуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	Наименование = ДополнительныеПараметры.Наименование;
	РезультатОповещения = ДополнительныеПараметры.РезультатОповещения;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ПутьКОбъекту=ДиалогОткрытияФайла.ВыбранныеФайлы[0];
	Иначе
		ПутьКОбъекту="";
	КонецЕсли;
	
	ОбработкаРезультатаОповещенияПутьКОбъектуФрагмент(Наименование, ПутьКОбъекту, РезультатОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПутьКОбъектуФрагмент(Наименование, ПутьКОбъекту, РезультатОповещения)
	
	Если РезультатОповещения<>Неопределено Тогда
		Элементы.ОтчетыИОбработки.ТекущиеДанные.ПутьКОбъекту=ПутьКОбъекту;
		Элементы.ОтчетыИОбработки.ТекущиеДанные.Наименование=Наименование;
	Иначе
		Элементы.ОтчетыИОбработки.ТекущиеДанные.ПутьКОбъекту="";
		Элементы.ОтчетыИОбработки.ТекущиеДанные.Наименование="";
	КонецЕсли;
	Элементы.ОтчетыИОбработки.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры 

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	УправлениеДиалогомСправочникаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры 

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
//@skip-warning
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов


#КонецОбласти

#КонецОбласти
